LEXICON_COMMANDS: dict[str, str] = {
    "/edit_item_list": "Изменить список товаров",
    "/edit_store_list": "Изменить список магазинов",
    "/help": "Помощь"
}


LEXICON: dict[str, str] = {
    'start': "Я бот-помощник, который подскажет где купить продукты выгоднее. "
             "Что узнать как со мной взаимодействовать нажми кнопку Помощь в главном меню"
             "или отправь мне команду /help",
    'help': "Данный раздел в разработке",
    'item': 'товар',
    'store': 'магазин',
    'items': 'список товаров',
    'stores': 'список магазинов',
    'got_it': 'записал.\nЧто-то ещё?',
    'in_list': 'уже есть в списке\nпопробуй по-другому',
    'cross_out': 'удалил.\n\n',
    'send_item': 'Отправь мне наименование товара',
    'send_store': 'Отправь мне название магазина',
    'empty_list': 'Список сейчас пуст, добавим что-нибудь?',
    'choice_item': 'Что необходимо удалить?',
}


LEXICON_BTN: dict[str, str] = {
    'yes': '✅Давай',
    'no': '❌Не сейчас',
    'cancel': '❌Отмена',
    'stop': '✅Пока всё',
    'add_item': '📝 Добавить',
    'del_item': '🗑 Удалить',

}




