LEXICON_COMMANDS: dict[str, str] = {
    "/edit_item_list": "Изменить список товаров",
    "/edit_store_list": "Изменить список магазинов",
    "/help": "Помощь"
}


LEXICON: dict[str, str] = {
    'start': "Я бот-помощник, который подскажет где купить продукты выгоднее. "
             "Что узнать как со мной взаимодействовать нажми кнопку Помощь в главном меню"
             "или отправь мне команду /help",
    'help': "Данный раздел в разработке"
}


LEXICON_BTN: dict[str, str] = {
    'yes': 'Давай',
    'no': 'Не сейчас',
    'stop_add': 'Завершить ввод',
    'cancel': 'Выйти из режима',
    'add_item': 'Добавить товар',
    'del_item': 'Удалить товар',
    'show_list': 'Показать список'
}




