LEXICON_COMMANDS: dict[str, str] = {
    "/edit_item_list": "Изменить список товаров",
    "/edit_store_list": "Изменить список магазинов",
    "/edit_matrix": "Изменить таблицу цен",
    "/show_store": "Показать список покупок",
    "/help": "Помощь"
}


LEXICON: dict[str, str] = {
    'start': "Я бот-помощник, который подскажет где купить продукты выгоднее. "
             "Что узнать как со мной взаимодействовать нажми кнопку Помощь в главном меню"
             "или отправь мне команду /help",
    'help': "Данный раздел в разработке",
    'item': 'товар',
    'store': 'магазин',
    'chg_items': 'Изменить список товаров?',
    'chg_stores': 'Изменить список магазинов?',
    'got_it': 'записал.\nЧто-то ещё?',
    'in_list': 'уже есть в списке\nпопробуй по-другому',
    'cross_out': 'удалил.',
    'send_item': 'Отправь мне наименование товара',
    'send_store': 'Отправь мне название магазина',
    'send_price': 'Отправь мне цену',
    'empty_list': 'Список сейчас пуст, добавим что-нибудь?',
    'choice_item': 'Что необходимо удалить?',
    'fill_item_list': 'Список товаров пуст\nЕго нужно заполнить',
    'fill_store_list': 'Список магазинов пуст\nЕго нужно заполнить',
    'chs_store': 'Выбери магазин:',
    'chs_item': 'Выбери товар',
    'non_digit': '‼️Цена может состоять только из цифр разделённых с одной точкой или запятой‼️',
    'empty_matrix': 'Сначала необходимо заполнить таблицу магазинов и товаров',
    'empty_prices': 'Не заполнено ни одной цены на товар ни в одном магазине',
    'show_method': 'Как тебе удобнее показать список?',
    'list_best_price': 'Это лучшие цены на товары из списка среди магазинов:\n',
    'list_best_in_store': 'лучшая цена на эти товары:\n'
}


LEXICON_BTN: dict[str, str] = {
    'yes': '✅Давай',
    'no': '❌Не сейчас',
    'cancel': '↪️назад', # '❌Отмена',
    'stop': '✅Пока всё',
    'add_item': '📝 Добавить',
    'del_item': '🗑 Удалить',
    'show_list': 'Показать список покупок',
    'chs_store': 'Выбрать магазин'

}




